{
  "Api": "flower-apí",
  "version": "1.0.0",
  "google-service": "cloud-run",
  "flower_data": [
    {
      "id": 1,
      "name": "GIRASOL",
      "scientific_name": "Helianthus annuus",
      "description": "Llamado comúnmente girasol, calom, jáquima, maravilla, mirasol, tlapololote, maíz de teja, acahual​ (del náhuatl atl, agua y cahualli, dejado, abandonado)  o flor de escudo (del náhuatl chimali, escudo y xochitl, flor), es una planta herbácea anual de la familia de las asteráceas originaria de Centro y Norteamérica y cultivada como alimenticia, oleaginosa y ornamental en todo el mundo.",
      "applications": "Hay distintos tipos de girasoles: oleaginosos, de confitura o confitería, de alto contenido de ácido oleico y ornamentales.El girasol contiene hasta un 58 % de aceite en su fruto, aceite que se utiliza para cocinar, y también para producir biodiésel. El aceite de girasol virgen —obtenido del prensado de las pipas, aunque no posee las cualidades del aceite de oliva, sí posee una cantidad cuatro veces mayor de vitamina E natural que este.El 'orujo' que queda después de la extracción del aceite se utiliza como alimento para el ganado.Los tallos contienen una fibra que puede ser usada en la elaboración del papel, y las hojas pueden servir también de alimento para el ganado.",
      "properties": "En Sonora se usa en diversas enfermedades como pleuresía, resfriado, catarro, para las llagas, heridas, trastornos nerviosos, dolor de cabeza, y en el estado de Veracruz se indica para las reumas. En la mayoría de los casos se recomienda emplear el tallo. Sin embargo, para aliviar las reumas se aconseja hacer una maceración en alcohol de las semillas y con esto friccionar las partes afectadas.  flowe:La época de siembra para el cultivo de secano varía según la latitud, pero dura aproximadamente un mes a contar del inicio del verano. La siembra se debe efectuar en hileras separadas a 0,70 m, con una densidad de siembra de cuatro plantas por metro lineal.  Es un cultivo poco exigente en el tipo de suelo, aunque prefiere los arcillo-arenosos y ricos en materia orgánica, pero es esencial que el suelo tenga un buen drenaje y la capa freática se encuentre a poca profundidad.  La germinación de las semillas de girasol depende de la temperatura y de la humedad del suelo, siendo la temperatura media de 5 °C durante 24 horas.  La profundidad de siembra se realiza en función de la temperatura, humedad y tipo de suelo.  En zonas húmedas con primaveras cálidas, con suelos pesados y húmedos, la profundidad de siembra es de 5 a 6 cm. En zonas con primaveras secas, con suelos ligeros y poca humedad, la profundidad de siembra es de 7 a 9 cm. Si el terreno es ligero y mullido la profundidad de siembra es mayor, al contrario que ocurre si el suelo es pesado. Las plantas que proceden de siembras superficiales germinan y florecen antes que las procedentes de siembras profundas. Algunas variedades desarrolladas recientemente tienen cabezas decaídas. Estas variedades son menos atractivas para los jardineros que crían las flores como ornamento, pero atractivas para los granjeros, porque pueden reducir los daños producidos por los pájaros y las pérdidas por enfermedades vegetales."
    },
    {
      "id": 2,
      "name": "MARGARITA",
      "scientific_name": "Bellis perennis",
      "description": "Llamado comúnmente margarita común, chiribita, pascueta o vellorita es  una planta herbácea muy utilizada a efectos decorativos mezclada con el césped, por su resistencia a la siega.",
      "applications": "Antitusiva y expectorante6​ gracias a los saponósidos, resina y mucílagos. 1)Diurética6​ y sudorífica debidas a los taninos. -Cicatrizante. -Para controlar la presión arterial. -Antiespasmódica. -Demulcente, digestiva, emoliente y laxante.                         -Oftálmica.                         -Purgativas y tónicas.                         Las partes utilizadas son las hojas, raíces y flores, aunque las raíces son las que se usan con menos frecuencia.",
      "properties": "Es un popular remedio contra muchas enfermedades y tiene una gran variedad de formas de aplicación. Es la hierba tradicionalmente utilizada contra las heridas, ampollas, quemaduras y para disminuir inflamaciones.Las raíces se utilizan en el tratamiento del escorbuto y eccemas dérmicos. No se ha descrito ningún tipo de toxicidad para esta especie.CULTIVO: Como planta ornamental de temporada y dentro del grupo de plantas de otoño, tras realizar el semillero y tener las plántulas ya germinadas (planta joven), procederemos a su plantación en unas macetas de unos 10 centímetros de diámetro aproximadamente. Una vez crezcan y adquieran un tamaño razonable, las podremos plantar en el jardín directamente… tal y como las hubiésemos comprado de un vivero, centro de jardinería, etc.La plantación de Bellis perennis en el jardín se debe de realizar en zonas con un suelo fértil (aunque es bastante rústica), en una zona bien iluminada y colocando las plantas entre 15 y 25 centímetros entre sí, procurando unificar la variedad (los colores de sus flores) para aumentar su ‘impacto’ visual.El sustrato indicado en este caso es un ‘sustrato universal‘ o ‘sustrato para plantas de exterior‘, con un pH de entre 5,6 y 6,2. La Ec (conductibilidad eléctrica del sustrato) deseada debe de situarse entre 1,5 y 2.Las temperaturas ideales son entre 2 a 6ºC durante la noche y de 20 a 25 durante el día. Por debajo de ellas se ralentizará su desarrollo y por encima se acelerará, en ambos casos, su crecimiento no será el idóneo.La exposición de las nuevas plantas recién plantadas será a pleno sol ya que en esta época del año, cuando se cultiva la Bellis perennis, el tiempo no es muy caluroso.Los riegos serán moderados, siendo frecuentes durante la primera semana y distanciados durante el resto de cultivo para favorecer el desarrollo radicular.Los abonados pueden realizarse a partir de las 4 ó 5 semanas de cultivo con un abono del tipo 18-12-24 en fertirrigación (abono mezclado en el agua de riego), a una dosis de 1 gramo por litro y con una frecuencia de 2 veces a la semana.Las plagas más comunes que se pueden presentar son la mosca blanca, el minador y orugas.En cuanto a las enfermedades no son muy frecuentes, pero en el caso de riesgo, el Pythium puede ser el más propenso a manifestarse.En estas condiciones, el tiempo de cultivo de Bellis perennis desde su repicado (plantación a la maceta) y estar listas para su plantación directamente en el jardín es de 8 a 12 semanas."
    },
    {
      "id": 3,
      "name": "DIENTE DE LEON",
      "scientific_name": "Taraxacum officinale",
      "description": "Llamado comunmente como diente de leon, achicoria amarga y meacamas,1​ es una especie de la familia de las asteráceas.Considerada generalmente como una mala hierba, aunque sería más correcto decir 'hierbaadventicia', sus hojas se consumen en ensalada y se le han atribuido numerosas propiedades medicinales.",
      "applications": "Es una planta depurativa, indicada para purificar el organismo de elementos tóxicos. Puede actuar en el hígado, riñón y la vesícula biliar, y con su efecto diurético evita la aparición de piedras en el riñón. También es un tónico digestivo contra el estreñimiento y la resaca de alcohol. Para uso tópico es eficaz para limpiar la impurezas de la piel, acné, urticaria. Estas propiedades se deben a su contenido de inulina, ácidos fenólicos y sales minerales, entre otras sustancias que aportan beneficios a la piel. En algunos periodos de escasez, la raíz seca se ha utilizado como sustituto de la achicoria, que a su vez es sustituto del café. Sus hojas silvestres o cultivadas son comestibles, se prefieren las que son jóvenes y tiernas para ensaladas mientras que las maduras, al ser más amargas, se consumen cocidas, aunque está sin confirmarse la existencia de cultivos para este fin.",
      "properties": "Entre los propiedades principales que contiene, podríamos destacar los minerales como hierro, potasio, calcio, zinc, magnesio y fósforo y las vitaminas como la vitamina K y vitamina C, además de contener grandes cantidades de betacaroteno, la provitamina A que una vez asimilada por el organismo se transforma en vitamina A, y proteínas. Y por si fuera poco contiene contiene fitonutrientes y ácido quinurénico, excelentes para el sistema digestivo. Así como contienen altos niveles del antioxidante betacaroteno, que se sabe que proporcionan una fuerte protección contra el daño celular y el estrés oxidativo. También son ricos en antioxidantes llamados polifenoles, que se encuentran principalmente en la flor pero también están presentes en las raíces, hojas y tallos. Estas propiedades aportan grandes beneficios para el organismo, y debido a esto es muy útil para contrarrestar algunas dolencias como: -hepático / biliar -antirreumático, espasmolítico, anaflogístico, diurético -antidiscrático  CULTIVO: Aunque el diente de león es una planta silvestre que crece de forma espontánea en climas fríos y templados, también la podemos cultivar en casa.  Para preparar los semilleros simplemente entierra las semillas a unos 3 mm y cúbrelas con tierra dejando unos 4 cm cuadrados entre una y otra.  Riega bien. Los semilleros pueden estar compuestos de compost y arena.  Cuando la plántula mida unos 10 a 15 cm la podemos trasplantar a su lugar definitivo. Durante el verano debemos prestar especial atención al riego, no dejando pasar más de 3 días sin regarla.  Se puede adaptar tanto a zonas con luz directa como a la semisombra.  Con abonar ligeramente dos veces al año será suficiente para cubrir sus necesidades y mantenerla sana."
    },
    {
      "id": 4,
      "name": "ROSAS",
      "scientific_name": "Rosal",
      "description": "La rosa es una flor perteneciente a la familia de las Rosáceas que tiene gran popularidad en todo el mundo. Si bien la planta recibe el nombre de 'rosal', la denominación 'rosa' ha pasado a ser el nombre común de todas las flores de esta familia, las cuales bordean las 30 mil variedades. La popularidad de la rosa es tal que se encuentra entre las flores más vendidas del mundo, junto a los tulipanes y los claveles. Su comercio también es impulsado por ser uno de los ingredientes principales de perfumes, cremas y otros cosméticos.",
      "applications": "No todas las culturas mantienen en la actualidad el mismo uso medicinal de las rosas. Sin embargo, algunas de las recetas antiguas aún son practicadas sin que sean un reemplazo total de los métodos medicinales modernos. Entre los principales usos de los pétalos de rosas resaltan los siguientes: La infusión de pétalos de rosas puede ser usada como laxante suave. Algunas personas creen que incluso puede ayudar a combatir los parásitos intestinales. El agua de rosas también es usada en lociones para menguar el dolor de cabeza y otras afecciones. También recomiendan este líquido para realizar baños oculares en caso de conjuntivitis. El aceite de semillas de rosas es considerado como una buena propuesta para mantener el buen aspecto de la piel, favoreciendo la cicatrización y la regeneración. Esto es respaldado por varios estudios y se observa en el uso de esta flor en la industria estética y cosmética mundial. Las rosas son también importantes en la aromaterapia, técnicas usadas desde el antiguo Egipto. Según los especialistas, el aroma natural de esta flor puede reducir la depresión, la angustia, la pena y el insomnio. También está relacionada con el aumento de la pasión y el deseo.",
      "properties": "El agua de rosas es un extracto natural que se obtiene de los pétalos de la flor. Ha sido muy utilizada como un remedio natural con antioxidantes que hidratan y rejuvenecen la piel y ayudan a la cicatrización y tratamiento de manchas, estrías y arrugas. Estas son algunas de las propiedades de este elixir de belleza:  Efecto antiinflamatorio. El agua de rosas ayuda a reducir el enrojecimiento de la piel y a tratar afecciones como el acné, dermatitis o úlceras cutáneas. Evita también, la formación de bolsas en los ojos.  Cicatrizante. Sus propiedades antibacterianas, aceleran la sanación de heridas, cortes y a atenuar las cicatrices.  Retrasa el envejecimiento. Posee antioxidantes que fortalecen las células de la piel y ayudan a regenerar tejidos. Además, disimula las líneas de expresión.   Elimina impurezas. Limpia profundamente controlando el exceso de grasa y la suciedad acumulada en los poros.  Mejora la calidad del cabello. Sus componentes nutritivos e hidratantes actúan sobre las inflamaciones leves del cuero cabelludo y la caspa. Por otro lado, nutre el pelo estimulando su crecimiento, evitando su caída y dándole un aspecto mucho más saludable.  Alivia el dolor de cabeza. Aplicar pañuelos humedecidos con agua de rosas en la frente, puede resultar un remedio muy útil en caso de migrañas o jaquecas.  Reafirmanta. Su contenido de vitamina B y E, taninos y pectina, lo convierten en un gran tónico que actúa reafirmando la piel.  Relaja y refresca. Intenta rociar un poco de agua de rosas sobre rostro y cuello cada vez que te sientas cansada y estresada. En pocos minutos te sentirás mucho más reconfortada gracias a su sutil fragancia.  Perfecta para todo tipo de piel. Sus componentes la hacen un tónico perfecto para pieles grasas y secas o con cualquier tipo de afección cutánea.  CULTIVO: A menudo se dice que las rosas son flores delicadas que merecen un cuidado especial. Sin embargo, esto no impide que se pueda adaptar su cuidado t anto a jardines grandes como a pequeños. En cualquiera de estos casos, es importante que tengas en cuenta los siguientes consejos: Las rosas son flores de clima cálido, así que se recomienda tenerlas en un lugar en donde pueda tener regularmente exposición al sol. En caso de encontrarse en una zona más fría, se debe procurar no tenerla por mucho tiempo en temperaturas menores a los 15 grados. Las rosas no requieren de agua constantemente, pero su riego debe ser más cuidadoso si es que se encuentran en un lugar reducido. Por lo general, se recomienda usar el método del goteo para evitar que las flores desarrollen hongos por exceso de agua. En el caso de tener rosas en macetas, el riego debe ser diario, sin que la planta termine inundada. Opta por el abono orgánico. No solo mejorará el aspecto de tus rosas, sino también restaurará mucho mejor los nutrientes que necesita para poder florecer. Se recomienda hacerlo una vez al año. Cuando el rosal ya haya dado sus primeras rosas se debe tener cuidado para poder cortarlas. Una manipulación excesiva solo ocasionará que la flor se estropee. Tras esto, y ya en invierno, opta por realizar una poda completa de tu rosal. Esto quiere decir que deberás cortar la madera seca y las ramas improductivas para mantener el ciclo de la flor. Recuerda que la poda se debe realizar por encima de la yema. Se recomienda que el corte se realice en un ángulo de 45 grados."
    },
    {
      "id": 5,
      "name": "TULIPANES",
      "scientific_name": "Tulipa",
      "description": "Tulipa es un género de plantas perennes y bulbosas perteneciente a la familia Liliaceae, en el que se incluyen  los populares tulipanes, nombre común con el que se designa a todas las especies, híbridos y cultivares de este género.  Tulipa contiene aproximadamente 150 especies e innumerables cantidades de híbridos y cultivares conseguidos a través de  mejoramiento genético que los floricultores fueron realizando desde el siglo XVI.",
      "applications": "En Europa, el tulipán no solo alcanzó fama como flor decorativa, sino también como analgésico en caso de dolencias estomacales. El té de las hojas de tulipán es reconocido como un potente laxante en caso de dolores del vientre. Se recomienda especialmente a las mujeres, sin que esto deje de lado el cuidado médico especializado. Las semillas del tulipán, principalmente de su variante conocida como 'Rosadechina', son usadas para combatir el mal aliento. Solo basta con masticarlas. Otro uso señala que al hacer cataplasmas con ellas se puede tratar las irritaciones de la piel. En el caso de la raíz, esta es utilizada para elaborar baños para el cabello, mejorando su aspecto y su salud. Por último, también se dice que la infusión de esta flor puede aumentar el deseo sexual, por lo cual algunos lo usan como vigorizante antes de las relaciones.",
      "properties": " El tulipán tiene muchas propiedades medicinales por solo citar algunas podemos mencionar su efecto laxante y analgésico, esto produce que el tulipán esté presente en una gran cantidad de remedios naturales con muchos propósitos diferentes como:  Previene la caída del cabello. El tulipán posee propiedades que fortalecen las raíces del cabello lo cual puede a ayudar combatir la caída de pelo.  Es un afrodisiaco. Puedes utilizar el tulipán como un afrodisiaco  debido a que sus flores poseen propiedades que aumentan el deseo sexual. Solo tienes que hacer una infusión con una cuchara pequeña de flores media hora antes del acto.  Ayuda a cuidar la piel. El tulipán tiene compuestos químicos que hidratan la piel. Por lo que aparte de cuidar tu piel puede ayudar a aliviar el acné, quemaduras solares y heridas.  Aparte de todas esta propiedades el tulipán se esta utlizando  para investigaciones científicas en contra del cáncer. Se cree que estas plantas pueden detener la proliferación de células cancerígenas   CULTIVO: El tulipán es una flor altamente comercial, pero muchos se animan a cultivarla en sus jardines. Sin embargo, requiere de cuidados especiales y de bastante dedicación. Para iniciarte en su cultivo puedes comprar los bulbos de la flor, los mismos que se venden en florerías o en centros especializados. Es importante que revises bien tu adquisición para asegurarte que no tenga hongos o estén secos. El tamaño del bulbo también dará una idea de cuán grande puede llegar a ser la flor. El siguiente paso es guardar el bulbo de tulipán en un lugar fresco hasta el momento de su plantación. Lo ideal es que no sean expuestos al sol directo, pero que tampoco estén en un frío extremo. Este proceso de conservación del bulbo es importante porque permite que la flor sea plantada en la mejor época del año para este fin, otoño, y así no sufra las inclemencias del clima en su crecimiento. Ya en otoño, se recomienda buscar un suelo ligero que pueda retener la humedad, sin llegar a inundarse. No los plantes en donde les dé luz solar directa porque eso puede estropear el florecimiento. El proceso para plantarlo es sencillo: luego de preparar el suelo, se planta el bulbo a una profundidad de 25 centímetros y luego se cubre con tierra. La punta del bulbo debe quedar hacia arriba y los bulbos deben estar al menos a 10 centímetros de distancia unos de otros. Pueden ser plantados también en macetas que tengan como mínimo 15 centímetros de diámetro. Ahora viene lo más importante: el riego y el cuidado. El tulipán requiere tierra húmeda sin que ésta esté inundada. Además, la tierra no debe estar excesivamente fría. Tampoco se recomienda poner fertilizantes cuando ya está plantado el bulbo. Si quieres hacer uso de abono, debes preparar la tierra antes de todo. Por lo general, estas flores solo necesitan los nutrientes del suelo. Si tienes tus tulipanes al aire libre evita que estos sean afectados por el aire frío directo. Si los tienes en maceta, puedes llevarlos dentro de casa cuando la planta ya tenga casi 8 centímetros. Cuando el tulipán está un poco más grande puedes agregarle un poco de fertilizante para plantas con flor. Esto le dará fortaleza. Cuando el tulipán está un poco más grande puedes agregarle un poco de fertilizante para plantas con flor. Esto le dará fortaleza. Cosecha tus tulipanes con cuidado. Recuerda que se recomienda cortarlos siempre en ángulos de 45 grados. Los bulbos del tulipán pueden darte hasta tres tandas flores, pero es recomendable desenterrarlos y cambiarlos cada año. Si tus tulipanes se han marchitado, se recomienda recortarlos desde la base para dejar que la flor se renueve."
    }
  ]
}
