{
  "Api": "flower-apí",
  "version": "1.0.0",
  "google-service": "cloud-run",
  "flower_data": [
    {
      "name": "GIRASOL",
      "scientific_name": "Helianthus annuus",
      "description": "Llamado comúnmente girasol, calom, jáquima, maravilla, mirasol, tlapololote, maíz de teja, acahual​ (del náhuatl atl, agua y cahualli, dejado, abandonado)  o flor de escudo (del náhuatl chimali, escudo y xochitl, flor), es una planta herbácea anual de la familia de las asteráceas originaria de Centro y Norteamérica y cultivada como alimenticia, oleaginosa y ornamental en todo el mundo.",
      "applications": "Hay distintos tipos de girasoles: oleaginosos, de confitura o confitería, de alto contenido de ácido oleico y ornamentales.El girasol contiene hasta un 58 % de aceite en su fruto, aceite que se utiliza para cocinar, y también para producir biodiésel. El aceite de girasol virgen —obtenido del prensado de las pipas, aunque no posee las cualidades del aceite de oliva, sí posee una cantidad cuatro veces mayor de vitamina E natural que este.El 'orujo' que queda después de la extracción del aceite se utiliza como alimento para el ganado.Los tallos contienen una fibra que puede ser usada en la elaboración del papel, y las hojas pueden servir también de alimento para el ganado.",
      "properties": "En Sonora se usa en diversas enfermedades como pleuresía, resfriado, catarro, para las llagas, heridas, trastornos nerviosos, dolor de cabeza, y en el estado de Veracruz se indica para las reumas. En la mayoría de los casos se recomienda emplear el tallo. Sin embargo, para aliviar las reumas se aconseja hacer una maceración en alcohol de las semillas y con esto friccionar las partes afectadas.  flowe:La época de siembra para el cultivo de secano varía según la latitud, pero dura aproximadamente un mes a contar del inicio del verano. La siembra se debe efectuar en hileras separadas a 0,70 m, con una densidad de siembra de cuatro plantas por metro lineal.  Es un cultivo poco exigente en el tipo de suelo, aunque prefiere los arcillo-arenosos y ricos en materia orgánica, pero es esencial que el suelo tenga un buen drenaje y la capa freática se encuentre a poca profundidad.  La germinación de las semillas de girasol depende de la temperatura y de la humedad del suelo, siendo la temperatura media de 5 °C durante 24 horas.  La profundidad de siembra se realiza en función de la temperatura, humedad y tipo de suelo.  En zonas húmedas con primaveras cálidas, con suelos pesados y húmedos, la profundidad de siembra es de 5 a 6 cm. En zonas con primaveras secas, con suelos ligeros y poca humedad, la profundidad de siembra es de 7 a 9 cm. Si el terreno es ligero y mullido la profundidad de siembra es mayor, al contrario que ocurre si el suelo es pesado. Las plantas que proceden de siembras superficiales germinan y florecen antes que las procedentes de siembras profundas. Algunas variedades desarrolladas recientemente tienen cabezas decaídas. Estas variedades son menos atractivas para los jardineros que crían las flores como ornamento, pero atractivas para los granjeros, porque pueden reducir los daños producidos por los pájaros y las pérdidas por enfermedades vegetales."
    }
  ]
}
